# **#41 Menerapkan agregasi pada sejumlah kolom dengan agg()**

**Import Modules**

In [4]:
import pandas as pd

print(pd.__version__)

2.2.2

**Persiapan Data Frame**

In [ ]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

**Menerapkan agregasi pada sejumlah kolom dengan agg()**

- Untuk menerapkan agregasi kita bisa menggunakan fungsi agg()
- Untuk menggunakan fungsi ini minimal kita membutuhkan 2 buah parameter yaitu : kolom yang ingin dikenakan fungsi : fungsi agregasi
- Selain menggunakan simbol pemisah titik dua, kita juga bisa menggunakan tanda koma
- Ada opsi tambahan untuk membuat nama tabel baru. Caranya sama seperti memasukkan sebuah nilai kedalam suatu variabel

In [ ]:
df.groupby('pclass').agg({'pclass':'count', 
                          'age':['mean', 'max'], 
                          'survived': 'mean'})

In [ ]:
df.groupby('pclass').agg(n_pass=('pclass', 'count'),
                         avg_age=('age', 'mean'),
                         max_age=('age', 'max'), 
                         survival_rate=('survived', 'mean'))

# **#42 Mengurutkan data berdasarkan kolom tertentu**

**Import Modules**

In [10]:
import pandas as pd 

print(pd.__version__)

2.2.2

**Persiapan Data Frame**

In [ ]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

**Mengurutkan data berdasarkan kolom tertentu**

- Untuk mengurutkan data kita bisa menggunakan fungsi sort_values()
- Fungsi ini secara default mengurutkan secara ascending/ meningkat dari yang - paling rendah
- Untuk mengubah urutan menjadi decending kita bisa menambahkan parameter ascending=false
- Fungsi ini juga mengurutkan berdasarkan urutan penempatan kolom
- Sebagai contoh dibawah kolom survived akan diurutkan dahulu kemudian kolom age selanjutnya.

In [ ]:
df.sort_values('age').head()

In [ ]:
df.sort_values('age', ascending=False).head()

In [ ]:
df.sort_values(['survived', 'age']).head()

# **#43 Menangani whitespace pada Data Frame**

**Import Modules**

In [17]:
import pandas as pd
import numpy as np 

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

**Persiapan Data Frame**

In [20]:
data = {'nim': ['10', '11', '12', '13', '  '],
        'nama': ['adi', '  ', 'tejo', '  ', 'bejo']}

df = pd.DataFrame(data)
df

  nim  nama
0  10   adi
1  11
2  12  tejo
3  13
4      bejo

**Menangani Whitespace pada Data Frame**

In [23]:
df

  nim  nama
0  10   adi
1  11
2  12  tejo
3  13
4      bejo

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nim     5 non-null      object
 1   nama    5 non-null      object
dtypes: object(2)
memory usage: 212.0+ bytes

In [27]:
df = df.replace(r'^\s*$', np.nan, regex=True)
df

   nim  nama
0   10   adi
1   11   NaN
2   12  tejo
3   13   NaN
4  NaN  bejo

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nim     4 non-null      object
 1   nama    3 non-null      object
dtypes: object(2)
memory usage: 212.0+ bytes

# **#44 Menata ulang penempatan kolom pada Data Frame**

**Import Modules**

In [33]:
import pandas as pd
import numpy as np 

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

**Persiapan Data Frame**

In [36]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  1  3  4  6  1
1  5  6  3  2  8
2  9  7  9  7  1
3  7  3  4  2  1
4  4  8  8  5  5

**Menata ulang penempatan kolom pada Data Frame**

- Untuk menata ulang, kita hanya perlu memindahkann urutan kolom yang kita mau seperti contoh di bawah
- Untuk menyimpan perubahan penempatan kolom bisa kita masukkan kedalam variabel.

In [39]:
df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  6  4  1  1  3
1  2  3  5  8  6
2  7  9  9  1  7
3  2  4  7  1  3
4  5  8  4  5  8

In [41]:
df

   A  B  C  D  E
0  1  3  4  6  1
1  5  6  3  2  8
2  9  7  9  7  1
3  7  3  4  2  1
4  4  8  8  5  5

In [43]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  6  4  1  1  3
1  2  3  5  8  6
2  7  9  9  1  7
3  2  4  7  1  3
4  5  8  4  5  8